GadjetOnOff_Project/src/Documents/ЗаказыКлиента/ЗаказыКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказыКлиента</name>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.СтатусЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

GadjetOnOff_Project/src/InformationRegisters/УчетЦенНоменклатуры/УчетЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетЦенНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GadjetOnOff_Project/src/Documents/ЗаказыКлиента/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена * (100 - ТекДанные.ПроцентСкидки)/100; 
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Цена = СписокНоменклатурыНоменклатураПриИзмененииНаСервере(ТекДанные.Номенклатура);
КонецПроцедуры

&НаСервере
Функция СписокНоменклатурыНоменклатураПриИзмененииНаСервере(Номенклатура)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчетЦенНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.УчетЦенНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК
		|		УчетЦенНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Цена = ВыборкаДетальныеЗаписи.Цена;
	Иначе
		Цена = 0;
	КонецЕсли;
	
	Возврат Цена;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции
